In [5]:
import numpy as np 
import pandas as pd

In [7]:
dict1 = {
    "name": ['Abdullah', 'Umair', 'Usman', 'Sameer'],
    "marks": [92,34,56,85],
    "city": ['Karachi', 'Peshawar', 'Islamabad', 'Lahore' ]
}

In [9]:
df = pd.DataFrame(dict1)

In [11]:
df

       name  marks       city
0  Abdullah     92    Karachi
1     Umair     34   Peshawar
2     Usman     56  Islamabad
3    Sameer     85     Lahore

In [13]:
df.to_csv("friends.csv")

In [15]:
df.to_csv("friends_index_false.csv", index=False)

In [17]:
df.head(2)

       name  marks      city
0  Abdullah     92   Karachi
1     Umair     34  Peshawar

In [19]:
df.tail(2)

     name  marks       city
2   Usman     56  Islamabad
3  Sameer     85     Lahore

In [21]:
# calculate all the below entites of the numerical columns in dataFrame
df.describe()

          marks
count   4.00000
mean   66.75000
std    26.82505
min    34.00000
25%    50.50000
50%    70.50000
75%    86.75000
max    92.00000

In [23]:
abdullah = pd.read_csv('abdullah.csv')

In [25]:
abdullah

   Train No  Speed       city
0    165465     56    Karachi
1     14564     32   Peshawar
2    445615     59  Islamabad
3    145615     26     Lahore

In [29]:
abdullah['Speed'][0]

56

In [31]:
abdullah['Speed'][0] = 100

C:\Users\Hamid\AppData\Local\Temp\ipykernel_1060\577262891.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  abdullah['Speed'][0] = 100

In [33]:
abdullah

   Train No  Speed       city
0    165465    100    Karachi
1     14564     32   Peshawar
2    445615     59  Islamabad
3    145615     26     Lahore

In [35]:
abdullah.to_csv('abdullah.csv')

In [37]:
ser = pd.Series(np.random.rand(10))

In [39]:
ser

0    0.412265
1    0.913219
2    0.777325
3    0.523231
4    0.838686
5    0.578817
6    0.461363
7    0.356095
8    0.921660
9    0.776135
dtype: float64

In [41]:
type(ser)

pandas.core.series.Series

In [43]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [45]:
newdf.head()

          0         1         2         3         4
0  0.267966  0.343110  0.719370  0.919940  0.927085
1  0.258618  0.237000  0.147334  0.623601  0.114920
2  0.128321  0.778908  0.352413  0.714555  0.339263
3  0.263381  0.849529  0.362151  0.390156  0.361220
4  0.960950  0.265285  0.015323  0.834424  0.073846

In [47]:
type(newdf)

pandas.core.frame.DataFrame

In [49]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.517466    0.479567    0.485397    0.522750    0.505736
std      0.281389    0.286849    0.291871    0.291061    0.284480
min      0.004002    0.005330    0.001041    0.003550    0.001571
25%      0.276777    0.232820    0.232651    0.287871    0.279201
50%      0.513535    0.481931    0.467358    0.552762    0.507271
75%      0.754914    0.732515    0.734214    0.776945    0.742959
max      0.989939    0.997984    0.999374    0.997864    0.993425

In [53]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [55]:
newdf[0][0] = 'Abdullah'

C:\Users\Hamid\AppData\Local\Temp\ipykernel_1060\2708645447.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = 'Abdullah'
C:\Users\Hamid\AppData\Local\Temp\ipykernel_1060\2708645447.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Abdullah' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = 'Abdullah'

In [57]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [59]:
newdf.head()

          0         1         2         3         4
0  Abdullah  0.343110  0.719370  0.919940  0.927085
1  0.258618  0.237000  0.147334  0.623601  0.114920
2  0.128321  0.778908  0.352413  0.714555  0.339263
3  0.263381  0.849529  0.362151  0.390156  0.361220
4   0.96095  0.265285  0.015323  0.834424  0.073846

In [61]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [63]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [65]:
newdf.to_numpy()

array([['Abdullah', 0.34311006068913075, 0.7193699027361596,
        0.9199397156737176, 0.9270845816521146],
       [0.2586180965275674, 0.23699986501820602, 0.14733371776311655,
        0.6236007955748454, 0.11491980483411923],
       [0.12832135608958772, 0.7789077734965788, 0.35241328487757106,
        0.7145551938577127, 0.33926258773566975],
       ...,
       [0.3612751711209754, 0.8793083451818353, 0.6227473866721019,
        0.7268350174769687, 0.5314626805256111],
       [0.49836821120937647, 0.5672622628390371, 0.969078292881757,
        0.758967216000106, 0.22256559321121083],
       [0.4787116542978125, 0.8533759139498559, 0.04800031989253639,
        0.6236905462713431, 0.7962102518190072]], dtype=object)

In [67]:
newdf[0][0]= 0.3456558

In [71]:
newdf.head()

          0         1         2         3         4
0  0.345656  0.343110  0.719370  0.919940  0.927085
1  0.258618  0.237000  0.147334  0.623601  0.114920
2  0.128321  0.778908  0.352413  0.714555  0.339263
3  0.263381  0.849529  0.362151  0.390156  0.361220
4   0.96095  0.265285  0.015323  0.834424  0.073846

In [73]:
newdf.to_numpy()

array([[0.3456558, 0.34311006068913075, 0.7193699027361596,
        0.9199397156737176, 0.9270845816521146],
       [0.2586180965275674, 0.23699986501820602, 0.14733371776311655,
        0.6236007955748454, 0.11491980483411923],
       [0.12832135608958772, 0.7789077734965788, 0.35241328487757106,
        0.7145551938577127, 0.33926258773566975],
       ...,
       [0.3612751711209754, 0.8793083451818353, 0.6227473866721019,
        0.7268350174769687, 0.5314626805256111],
       [0.49836821120937647, 0.5672622628390371, 0.969078292881757,
        0.758967216000106, 0.22256559321121083],
       [0.4787116542978125, 0.8533759139498559, 0.04800031989253639,
        0.6236905462713431, 0.7962102518190072]], dtype=object)

In [75]:
# a funtion for taking transpose of newdf  
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.345656,0.258618,0.128321,0.263381,0.96095,0.230193,0.812271,0.072716,0.524205,0.665063,...,0.109552,0.848806,0.905788,0.651741,0.978794,0.318689,0.912209,0.361275,0.498368,0.478712
1,0.34311,0.237,0.778908,0.849529,0.265285,0.948312,0.021328,0.777863,0.231426,0.789668,...,0.070822,0.032042,0.602465,0.395677,0.163582,0.585936,0.528468,0.879308,0.567262,0.853376
2,0.71937,0.147334,0.352413,0.362151,0.015323,0.581074,0.482516,0.363704,0.14972,0.459031,...,0.85984,0.46928,0.786293,0.530458,0.382046,0.905456,0.932127,0.622747,0.969078,0.048
3,0.91994,0.623601,0.714555,0.390156,0.834424,0.754651,0.208224,0.565781,0.624426,0.908817,...,0.643424,0.912335,0.014618,0.586008,0.468773,0.796074,0.006777,0.726835,0.758967,0.623691
4,0.927085,0.11492,0.339263,0.36122,0.073846,0.418283,0.748759,0.721444,0.00235,0.98465,...,0.001977,0.095521,0.670157,0.429016,0.159298,0.394517,0.27842,0.531463,0.222566,0.79621

In [77]:
newdf.head()

          0         1         2         3         4
0  0.345656  0.343110  0.719370  0.919940  0.927085
1  0.258618  0.237000  0.147334  0.623601  0.114920
2  0.128321  0.778908  0.352413  0.714555  0.339263
3  0.263381  0.849529  0.362151  0.390156  0.361220
4   0.96095  0.265285  0.015323  0.834424  0.073846

In [81]:
# axis=0 means row, and axis=1 means column
newdf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333  0.478712  0.853376  0.048000  0.623691  0.796210
332  0.498368  0.567262  0.969078  0.758967  0.222566
331  0.361275  0.879308  0.622747  0.726835  0.531463
330  0.912209  0.528468  0.932127  0.006777  0.278420
329  0.318689  0.585936  0.905456  0.796074  0.394517
..        ...       ...       ...       ...       ...
4     0.96095  0.265285  0.015323  0.834424  0.073846
3    0.263381  0.849529  0.362151  0.390156  0.361220
2    0.128321  0.778908  0.352413  0.714555  0.339263
1    0.258618  0.237000  0.147334  0.623601  0.114920
0    0.345656  0.343110  0.719370  0.919940  0.927085

[334 rows x 5 columns]

In [83]:
newdf.head()

          0         1         2         3         4
0  0.345656  0.343110  0.719370  0.919940  0.927085
1  0.258618  0.237000  0.147334  0.623601  0.114920
2  0.128321  0.778908  0.352413  0.714555  0.339263
3  0.263381  0.849529  0.362151  0.390156  0.361220
4   0.96095  0.265285  0.015323  0.834424  0.073846

In [85]:
newdf[0]

0      0.345656
1      0.258618
2      0.128321
3      0.263381
4       0.96095
         ...
329    0.318689
330    0.912209
331    0.361275
332    0.498368
333    0.478712
Name: 0, Length: 334, dtype: object

In [87]:
type(newdf[0])

pandas.core.series.Series

In [89]:
# it's not making a copy, newdf2 is a view for newdf, that;s why any changing in newdf2 will effect newdf also
newdf2 = newdf

In [91]:
newdf2[0][0]= 9524

In [93]:
newdf.head(2)

          0        1         2         3         4
0      9524  0.34311  0.719370  0.919940  0.927085
1  0.258618  0.23700  0.147334  0.623601  0.114920

In [97]:
# to make a copy !!!
newdf2 = newdf.copy()

In [99]:
newdf2[0][0]= 145648

C:\Users\Hamid\AppData\Local\Temp\ipykernel_1060\880882527.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf2[0][0]= 145648
C:\Users\Hamid\AppData\Local\Temp\ipykernel_1060\880882527.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0]= 145648

In [101]:
newdf.head(2)

          0        1         2         3         4
0      9524  0.34311  0.719370  0.919940  0.927085
1  0.258618  0.23700  0.147334  0.623601  0.114920

In [103]:
newdf2.head(2)

          0        1         2         3         4
0    145648  0.34311  0.719370  0.919940  0.927085
1  0.258618  0.23700  0.147334  0.623601  0.114920

In [105]:
newdf.loc[0,0] = 654

In [109]:
newdf.head(2)

          0        1         2         3         4
0       654  0.34311  0.719370  0.919940  0.927085
1  0.258618  0.23700  0.147334  0.623601  0.114920

In [111]:
# we can also change the values using loc function => location, and it is a good idea to change the values using this way 
newdf.loc[0, 'A'] = 564

In [113]:
newdf.head(2)

          0        1         2         3         4      A
0       654  0.34311  0.719370  0.919940  0.927085  564.0
1  0.258618  0.23700  0.147334  0.623601  0.114920    NaN

In [125]:
newdf=newdf.drop('A', axis=1)

In [127]:
newdf.head(2)

          0        1         2         3         4
0       654  0.34311  0.719370  0.919940  0.927085
1  0.258618  0.23700  0.147334  0.623601  0.114920

In [131]:
# to get some set of columns or rows!
newdf.loc[[1,2],[3,4]]

          3         4
1  0.623601  0.114920
2  0.714555  0.339263

In [133]:
# to get all the rows
newdf.loc[:, [3,4]]

            3         4
0    0.919940  0.927085
1    0.623601  0.114920
2    0.714555  0.339263
3    0.390156  0.361220
4    0.834424  0.073846
..        ...       ...
329  0.796074  0.394517
330  0.006777  0.278420
331  0.726835  0.531463
332  0.758967  0.222566
333  0.623691  0.796210

[334 rows x 2 columns]

In [137]:
# to get all the columns
newdf.loc[[1,2], :]

          0         1         2         3         4
1  0.258618  0.237000  0.147334  0.623601  0.114920
2  0.128321  0.778908  0.352413  0.714555  0.339263

In [145]:
# we can give more complex and multiple queries 
newdf.loc[(newdf[0] < 0.3) & (newdf[3] > 0.9)]

            0         1         2         3         4
62   0.086915  0.101386  0.511679  0.933805  0.207530
78   0.103904  0.155628  0.572153  0.959707  0.874679
124  0.284591  0.319839  0.247435  0.948253  0.925779
130  0.059036  0.818781  0.162256  0.900480  0.166867
167  0.298927  0.675488  0.125135  0.900909  0.062489
204  0.209435  0.489341  0.758035  0.902922  0.528097
211  0.069173  0.746971  0.988228  0.949977  0.264283
213  0.279937  0.529214  0.148584  0.904407  0.445715
266  0.240007  0.070888  0.283169  0.966793  0.090581
297  0.156669  0.348847  0.963849  0.960677  0.980351

In [147]:
newdf.head(2)

          0        1         2         3         4
0       654  0.34311  0.719370  0.919940  0.927085
1  0.258618  0.23700  0.147334  0.623601  0.114920

In [151]:
newdf.iloc[0,4]

0.9270845816521146

In [153]:
newdf.iloc[[2,5], [2,4]]

          2         4
2  0.352413  0.339263
5  0.581074  0.418283

In [159]:
# to drop any row
newdf=newdf.drop([0])

In [161]:
newdf.head()

          0         1         2         3         4
1  0.258618  0.237000  0.147334  0.623601  0.114920
2  0.128321  0.778908  0.352413  0.714555  0.339263
3  0.263381  0.849529  0.362151  0.390156  0.361220
4   0.96095  0.265285  0.015323  0.834424  0.073846
5  0.230193  0.948312  0.581074  0.754651  0.418283

In [165]:
newdf.reset_index()

     index         0         1         2         3         4
0        1  0.258618  0.237000  0.147334  0.623601  0.114920
1        2  0.128321  0.778908  0.352413  0.714555  0.339263
2        3  0.263381  0.849529  0.362151  0.390156  0.361220
3        4   0.96095  0.265285  0.015323  0.834424  0.073846
4        5  0.230193  0.948312  0.581074  0.754651  0.418283
..     ...       ...       ...       ...       ...       ...
328    329  0.318689  0.585936  0.905456  0.796074  0.394517
329    330  0.912209  0.528468  0.932127  0.006777  0.278420
330    331  0.361275  0.879308  0.622747  0.726835  0.531463
331    332  0.498368  0.567262  0.969078  0.758967  0.222566
332    333  0.478712  0.853376  0.048000  0.623691  0.796210

[333 rows x 6 columns]

In [169]:
newdf.reset_index(drop=True, inplace=True)

In [171]:
newdf.head(2)

          0         1         2         3         4
0  0.258618  0.237000  0.147334  0.623601  0.114920
1  0.128321  0.778908  0.352413  0.714555  0.339263

In [173]:
newdf.isnull()

         0      1      2      3      4
0    False  False  False  False  False
1    False  False  False  False  False
2    False  False  False  False  False
3    False  False  False  False  False
4    False  False  False  False  False
..     ...    ...    ...    ...    ...
328  False  False  False  False  False
329  False  False  False  False  False
330  False  False  False  False  False
331  False  False  False  False  False
332  False  False  False  False  False

[333 rows x 5 columns]

In [197]:
df = pd.DataFrame({
    'Name': ['John', 'Alice', 'Bob', 'Eve'],
    'Age': [23, 35, np.nan, 29],
    'City': ['New York', pd.NaT, 'Chicago', 'Houston']
})

In [199]:
df.head()

    Name   Age      City
0   John  23.0  New York
1  Alice  35.0       NaT
2    Bob   NaN   Chicago
3    Eve  29.0   Houston

In [195]:
df.dropna(how='all', axis=1)

    Name      City
0   John  New York
1  Alice       NaT
2    Bob   Chicago
3    Eve   Houston

In [201]:
df = pd.DataFrame({
    'Name': ['John', 'Alice', 'Bob', 'John'],
    'Age': [23, 35, np.nan, 29],
    'City': ['New York', pd.NaT, 'Chicago', 'Houston']
})

In [203]:
df.head()

    Name   Age      City
0   John  23.0  New York
1  Alice  35.0       NaT
2    Bob   NaN   Chicago
3   John  29.0   Houston

In [207]:
df.duplicated(subset=['Name'])

0    False
1    False
2    False
3     True
dtype: bool

In [211]:
df.drop_duplicates(subset=['Name'], keep='last')

    Name   Age     City
1  Alice  35.0      NaT
2    Bob   NaN  Chicago
3   John  29.0  Houston

In [213]:
df.drop_duplicates(subset=['Name'], keep=False)

    Name   Age     City
1  Alice  35.0      NaT
2    Bob   NaN  Chicago

In [218]:
# return rows and columns
df.shape

(4, 3)

In [220]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     3 non-null      float64
 2   City    3 non-null      object
dtypes: float64(1), object(2)
memory usage: 228.0+ bytes

In [230]:
df['Name'].value_counts(dropna=False)

Name
John     2
Alice    1
Bob      1
Name: count, dtype: int64

In [232]:
df.notnull()

   Name    Age   City
0  True   True   True
1  True   True  False
2  True  False   True
3  True   True   True

In [240]:
df = pd.DataFrame({
    'Train No': [16532, 15646, 41564],
    'Speed': [100,120,150]
})

In [244]:
df.head()

   Train No  Speed
0     16532    100
1     15646    120
2     41564    150

In [246]:
df.describe()

           Train No       Speed
count      3.000000    3.000000
mean   24580.666667  123.333333
std    14714.668101   25.166115
min    15646.000000  100.000000
25%    16089.000000  110.000000
50%    16532.000000  120.000000
75%    29048.000000  135.000000
max    41564.000000  150.000000

In [248]:
df.mean()

Train No    24580.666667
Speed         123.333333
dtype: float64

In [250]:
df.corr()

          Train No     Speed
Train No  1.000000  0.905284
Speed     0.905284  1.000000

In [252]:
df.count()

Train No    3
Speed       3
dtype: int64

In [254]:
df.max()

Train No    41564
Speed         150
dtype: int64

In [256]:
df.min()

Train No    15646
Speed         100
dtype: int64

In [258]:
df.median()

Train No    16532.0
Speed         120.0
dtype: float64

In [260]:
df.std()

Train No    14714.668101
Speed          25.166115
dtype: float64

In [ ]:
# That's all for pandas